Revit 2027 API
MechanicalSystem Properties
The MechanicalSystem type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BaseEquipment | The base panel or equipment of the system.
(Inherited from MEPSystem)
BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system.
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
ConnectorManager | Connector manager of the system.
(Inherited from MEPSystem)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
DuctNetwork |  The ducts and fittings contained within the system.
Elements | Terminal elements in the system.
(Inherited from MEPSystem)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasDesignParts |  Indicates if the system has one or more design parts.
(Inherited from MEPSystem)
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
(Inherited from MEPSystem)
HasPlaceholders |  Indicates if the system has one or more placeholders.
(Inherited from MEPSystem)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsEmpty |  Indicates if the system is empty or not.
(Inherited from MEPSystem)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
(Inherited from MEPSystem)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
(Inherited from MEPSystem)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
IsWellConnected |  Indicates if the system is well connected or not.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
(Inherited from MEPSystem)
SectionsCount |  The number of sections.
(Inherited from MEPSystem)
SystemType | The type of this duct system.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace